# (init) taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jeffreywildman/homebrew-virt-manager"


# fonts
cask "font-source-code-pro-for-powerline"

# browsers / chat
cask "discord"
cask "firefox-beta"
cask "google-chrome"
cask "signal"
cask "slack"

# b00ks
cask "calibre"

# 3d printer stuff
cask "ultimaker-cura"

# utilities - yubikey specific
brew "ykpers"
brew "ykman"
brew "ykneomgr"
cask "yubico-yubikey-manager"

# utilities - android specific
cask "android-file-transfer"
cask "android-platform-tools"

# utilities
cask "cyberduck"
cask "google-drive-file-stream"
cask "gpg-suite"
brew "iperf3"
cask "iterm2"
cask "keka"
cask "kekadefaultapp"
cask "keybase"
cask "nextcloud"
brew "speedtest-cli"
cask "suspicious-package"
brew "task"
brew "tasksh"
cask "transmission-remote-gui"
cask "transmit"
cask "virt-manager"
brew "wget"
brew "wireguard-tools"
brew "youtube-dl"

# media
cask "plex-media-player"
cask "iina"
cask "spotify"
cask "swinsian"
cask "vlc"

# development stuff
cask "atom"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "go"
brew "godep"
cask "goland"
cask "hex-fiend"
cask "insomnia"  # still not completely sold, postman is cheaper
brew "pinentry-mac"
cask "pycharm"
brew "python"
cask "sequel-pro-nightly"
cask "sourcetree"
cask "wireshark"

# virt & ops
brew "coreos-ct"
cask "docker"
brew "kubectl"
cask "vmware-fusion10"
